[Character.CharClass_DeathTrap AIClassDefinition]
DefaultDisplayName=""
UBMKilledByMessageString=""

[Misc.ReviveMessage_DeathTrapRes GenericReviveMessageDefinition]
Message_Self="Worrying about the disease helped %s, No thanks."
Message_Other="Thanks to the Dead Eaters!"

[Skills.Skill_AttackMode_MovementSpeed SkillDefinition]
SkillName="Attack style- Temp"
SkillDescription=""
LockedSkillDetailStr="<Locked>"

[Skills.Skill_DefenseMode_SelfRepair SkillDefinition]
SkillName="heal yourself"
SkillDescription=""
LockedSkillDetailStr="<Locked>"

[Skills.Skill_LaserSweep_OnDeathtrap SkillDefinition]
SkillName=""
SkillDescription=""
LockedSkillDetailStr="<Locked>"

[Skills.Skill_ShieldBoost_Player SkillDefinition]
SkillName="By Praven Hanserschild"
SkillDescription="A telepathic probe that recharges your shields"
LockedSkillDetailStr="<Locked>"

[Skills.Skill_ShockBall_Status SkillDefinition]
SkillName=""
SkillDescription=""
LockedSkillDetailStr="<Locked>"

